MikroElektronika/core_packages/PIC/XC8/def/PIC18F66K90/mcu.h
// Register: ANCON2
#define ANCON2 ANCON2
extern volatile unsigned char           ANCON2              __at(0xF23);
#ifndef _LIB_BUILD
asm("ANCON2 equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL16                :1;
        unsigned ANSEL17                :1;
        unsigned ANSEL18                :1;
        unsigned ANSEL19                :1;
    };
    struct {
        unsigned PCFG16                 :1;
        unsigned PCFG17                 :1;
        unsigned PCFG18                 :1;
        unsigned PCFG19                 :1;
    };
} ANCON2bits_t;
extern volatile ANCON2bits_t ANCON2bits __at(0xF23);
// bitfield macros
#define _ANCON2_ANSEL16_POSN                                0x0
#define _ANCON2_ANSEL16_POSITION                            0x0
#define _ANCON2_ANSEL16_SIZE                                0x1
#define _ANCON2_ANSEL16_LENGTH                              0x1
#define _ANCON2_ANSEL16_MASK                                0x1
#define _ANCON2_ANSEL17_POSN                                0x1
#define _ANCON2_ANSEL17_POSITION                            0x1
#define _ANCON2_ANSEL17_SIZE                                0x1
#define _ANCON2_ANSEL17_LENGTH                              0x1
#define _ANCON2_ANSEL17_MASK                                0x2
#define _ANCON2_ANSEL18_POSN                                0x2
#define _ANCON2_ANSEL18_POSITION                            0x2
#define _ANCON2_ANSEL18_SIZE                                0x1
#define _ANCON2_ANSEL18_LENGTH                              0x1
#define _ANCON2_ANSEL18_MASK                                0x4
#define _ANCON2_ANSEL19_POSN                                0x3
#define _ANCON2_ANSEL19_POSITION                            0x3
#define _ANCON2_ANSEL19_SIZE                                0x1
#define _ANCON2_ANSEL19_LENGTH                              0x1
#define _ANCON2_ANSEL19_MASK                                0x8
#define _ANCON2_PCFG16_POSN                                 0x0
#define _ANCON2_PCFG16_POSITION                             0x0
#define _ANCON2_PCFG16_SIZE                                 0x1
#define _ANCON2_PCFG16_LENGTH                               0x1
#define _ANCON2_PCFG16_MASK                                 0x1
#define _ANCON2_PCFG17_POSN                                 0x1
#define _ANCON2_PCFG17_POSITION                             0x1
#define _ANCON2_PCFG17_SIZE                                 0x1
#define _ANCON2_PCFG17_LENGTH                               0x1
#define _ANCON2_PCFG17_MASK                                 0x2
#define _ANCON2_PCFG18_POSN                                 0x2
#define _ANCON2_PCFG18_POSITION                             0x2
#define _ANCON2_PCFG18_SIZE                                 0x1
#define _ANCON2_PCFG18_LENGTH                               0x1
#define _ANCON2_PCFG18_MASK                                 0x4
#define _ANCON2_PCFG19_POSN                                 0x3
#define _ANCON2_PCFG19_POSITION                             0x3
#define _ANCON2_PCFG19_SIZE                                 0x1
#define _ANCON2_PCFG19_LENGTH                               0x1
#define _ANCON2_PCFG19_MASK                                 0x8

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xF24);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
        unsigned ANSEL11                :1;
    };
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
        unsigned PCFG11                 :1;
    };
} ANCON1bits_t;
extern volatile ANCON1bits_t ANCON1bits __at(0xF24);
// bitfield macros
#define _ANCON1_ANSEL8_POSN                                 0x0
#define _ANCON1_ANSEL8_POSITION                             0x0
#define _ANCON1_ANSEL8_SIZE                                 0x1
#define _ANCON1_ANSEL8_LENGTH                               0x1
#define _ANCON1_ANSEL8_MASK                                 0x1
#define _ANCON1_ANSEL9_POSN                                 0x1
#define _ANCON1_ANSEL9_POSITION                             0x1
#define _ANCON1_ANSEL9_SIZE                                 0x1
#define _ANCON1_ANSEL9_LENGTH                               0x1
#define _ANCON1_ANSEL9_MASK                                 0x2
#define _ANCON1_ANSEL10_POSN                                0x2
#define _ANCON1_ANSEL10_POSITION                            0x2
#define _ANCON1_ANSEL10_SIZE                                0x1
#define _ANCON1_ANSEL10_LENGTH                              0x1
#define _ANCON1_ANSEL10_MASK                                0x4
#define _ANCON1_ANSEL11_POSN                                0x3
#define _ANCON1_ANSEL11_POSITION                            0x3
#define _ANCON1_ANSEL11_SIZE                                0x1
#define _ANCON1_ANSEL11_LENGTH                              0x1
#define _ANCON1_ANSEL11_MASK                                0x8
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4
#define _ANCON1_PCFG11_POSN                                 0x3
#define _ANCON1_PCFG11_POSITION                             0x3
#define _ANCON1_PCFG11_SIZE                                 0x1
#define _ANCON1_PCFG11_LENGTH                               0x1
#define _ANCON1_PCFG11_MASK                                 0x8

